# โปรเจคที่ 3: โปรเเกรมคำณวนเเละประเมินความเสี่ยงสุขภาพอัจฉริยะ

#1. ฟังก์ชันคำณวนค่า BMI เเละเเปรผลตามหลักการเเพทย์
def calculate_bmi(weight_kg, height_cm):
    # เเปลงส่วนสูงจากเซนติเมตรให้เป็นเมตร
    height_m = height_cm / 100

    # สูตรคำณวน BMI = น้ำหนัก (กก.) / (ส่วนสูง (เมตร) ยกกำลังสอง)
    bmi = weight_kg / (height_m **2)

    #ตรวจสอบเงื่อนไขเพื่อวิเคราะห์ผลสุขภาพ
    if bmi < 18.5:
        status = "น้ำหนักน้อยกว่าเกณฑ์ (ผอม)"
        risk = "เสี่ยงสารอาหารไม่พอเพียง/ร่างกายอ่อนเพลียง่าย"
    elif 18.5 <= bmi < 23.0:
        status = "น้ำหนักปกติ (สุขภาพดี)"
        risk = "มีความเสี่ยงโรคต่ำที่สุดเท่ากับคนทั่วไป"
    elif 23.0 <= bmi < 25.0:
      status = "น้ำหนักเกิน (ท้วม)"
      risk = "เริ่มมีความเสี่ยงต่อโรคความดันโลหิตสูง"
    elif 25.0 <= bmi < 30.0:
        status = "อ้วนระดับที่ 2 (อ้วนมาก)"
        risk = "่มีความเสี่ยงโรคเบาหวานเเละไขมันอุดตันในเส้นเลือด"
    else:
        status = "อ้วนระดับที่ 2 (อ้วนมาก)"
        risk = "มีความเสี่ยงสูงมากต่อกลุ่มโรคไม่ติดต่อเรื้อรัง (NCDs)"
    
    return bmi, status, risk

#3. คำสั่งเปิดระบบรับค่าเเละเเสดงผล
print("=== ระบบประเมินสุขภาพอัฉริยะ ===")
w = float(input("กรอกน้ำหนักของคุณ (กิโลกรัม): "))
h = float(input("กรอกส่วนสูงของคุณ (เซนติเมตร): "))

# เรียกใช้งานฟังก์ชันเเละรับค่ากลับมาเเสดงผล
user_bmi, user_status, user_risk = calculate_bmi(w, h)

print("-" * 40)
print(f"ค่า BMI ของคุณคือ: {user_bmi:.2f}")
print(f"สถานะร่างกาย: {user_status}")
print(f"การประเมินความเสี่ยง: {user_risk}")
print("-" * 40)