# โปรเจกต์ที่ 1 : ระบบร้านค้าเเละสะสมเเต้มอัจฉริยะ
# 1. กำหนดฐานข้อมูลสินค้า (ใช้รหััสสินค้าเป้น key หลัก)
stock = {
    "P001": {"name": "Notebook", "price": 150.0, "qty": 10},
    "P002": {"name": "Pen", "price": 15.0, "qty": 50},
    "P003": {"name": "Backpack", "price": 590.0, "qty":5}
}
# 2. ฟังก์ชั่นสำหรับเเสดงสินค้าทั้งหมดในร้าน
def show_products():
    print("\n====== รายการสินค้าในร้าน ==")
    # จัดหน้าตารางด้วยคำสั่งเว้นช่องว่าง
    print(f"{'รหัส':<10}{'ชื่อสินค้า':<18}{'ราคา (บาท)':<14}{'คงเหลือ':<10}")
    print("-" * 55)

    # วนลูปดึงข้อมูลจาก Dictionary ออกมาเเสดงผล
    for item_id, info in stock.items():
        print(f"{item_id:<10}{info['name']:<18}{info['price']:<14.2f}{info['qty']:<10}")

# 3. คำสั่งเปิดระบบรันใช้งาน
show_products()